In [1]:
pip install pyspark

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pyspark
  Downloading pyspark-3.3.0.tar.gz (281.3 MB)
     |████████████████████████████████| 281.3 MB 45 kB/s
Collecting py4j==0.10.9.5
  Downloading py4j-0.10.9.5-py2.py3-none-any.whl (199 kB)
     |████████████████████████████████| 199 kB 56.1 MB/s
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.3.0-py2.py3-none-any.whl size=281764026 sha256=ec7e88de0e24c599b647335ad031e6e5a31e6fea39986867deb9d22267a110e3
  Stored in directory: /root/.cache/pip/wheels/7a/8e/1b/f73a52650d2e5f337708d9f6a1750d451a7349a867f928b885
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.5 pyspark-3.3.0

In [2]:
from pyspark.sql import SparkSession

In [3]:
spark = SparkSession.builder \
      .master("local[1]") \
      .appName("SparkByExamples.com") \
      .getOrCreate()

In [4]:
dataList = [("Java", 20000), ("Python", 100000), ("Scala", 3000)]
rdd=spark.sparkContext.parallelize(dataList)

In [5]:
rdd.count()

3

In [6]:
rdd.collect()

[('Java', 20000), ('Python', 100000), ('Scala', 3000)]

In [7]:
rdd.first()

('Java', 20000)

In [8]:
rdd.max()

('Scala', 3000)

In [9]:
rdd.min()

('Java', 20000)

In [11]:
rdd = spark.sparkContext.parallelize([1.0,5.0,41.0,10.0])
rdd.max()

41.0

In [13]:
#Creating dataframe
data = [('James' , '' , 'Smith' , '1991-04-01' , 'M' ,3000),
        ('Micheal' , 'Rose' , '' , '2000-05-19' , 'M' , 4000),
        ('Robert' , '' , 'Williams' , '1978-09-05' , 'M' , 4000),
        ('Maria', 'Anne' , 'Jones' , '1967-12-17', 'F' , 4000),
        ('Jen' , 'Mary' , 'Brown' , '1980-02-17','F',-1)]
columns = ['Firstname' , 'Middlename' , 'lastname' , 'DOB' , 'Gender', 'salary']
df = spark.createDataFrame(data=data , schema =columns)

In [14]:
df.show()

+---------+----------+--------+----------+------+------+
|Firstname|Middlename|lastname|       DOB|Gender|salary|
+---------+----------+--------+----------+------+------+
|    James|          |   Smith|1991-04-01|     M|  3000|
|  Micheal|      Rose|        |2000-05-19|     M|  4000|
|   Robert|          |Williams|1978-09-05|     M|  4000|
|    Maria|      Anne|   Jones|1967-12-17|     F|  4000|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|
+---------+----------+--------+----------+------+------+

In [29]:
#creating dataframe from rdd
columns = ['Language' , 'user_count']
data = [('Java' , 20000),('Python' , 100000) , ('Scala' , 1000)]

In [24]:
rdd = spark.sparkContext.parallelize(data)

In [25]:
dffromrdd1 = rdd.toDF()

In [26]:
dffromrdd1.printSchema()

root
 |-- _1: string (nullable = true)
 |-- _2: long (nullable = true)

In [27]:
columns = ['Language' , 'user_count']
dffromrdd1 = rdd.toDF(columns)
dffromrdd1.printSchema()

root
 |-- Language: string (nullable = true)
 |-- user_count: long (nullable = true)

In [35]:
#one line code / 2nd way
dffromrdd2= spark.createDataFrame(rdd).toDF(*columns)
dffromrdd2

DataFrame[Language: string, user_count: bigint]

In [32]:
#Creating Dataframe from list
columns = ['Language' , 'user_count']
data = [('Java' , 20000),('Python' , 100000) , ('Scala' , 1000)]

In [34]:
dffromlist = spark.createDataFrame(data).toDF(*columns)
dffromlist.show()

+--------+----------+
|Language|user_count|
+--------+----------+
|    Java|     20000|
|  Python|    100000|
|   Scala|      1000|
+--------+----------+

In [41]:
from pyspark.sql.types import StructType , StructField, StringType , IntegerType
data2 = [('James' , '' , 'Smith' , '36636' , 'M' ,3000),
        ('Micheal' , 'Rose' , '' , '40288' , 'M' , 4000),
        ('Robert' , '' , 'Williams' , '42114' , 'M' , 4000),
        ('Maria', 'Anne' , 'Jones' , '39192', 'F' , 4000),
        ('Jen' , 'Mary' , 'Brown' , '','F',-1)]

schema = StructType([\
                     StructField('Firstname',StringType(),True),\
                     StructField('Middlename' , StringType(),True),\
                     StructField('Lastname',StringType(),True),\
                     StructField('ID',StringType(),True),\
                     StructField('Gender',StringType(),True),\
                     StructField('Salary',IntegerType(),True)])     
df = spark.createDataFrame(data = data2 , schema = schema)
df.printSchema()
df.show(truncate=False)

root
 |-- Firstname: string (nullable = true)
 |-- Middlename: string (nullable = true)
 |-- Lastname: string (nullable = true)
 |-- ID: string (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Salary: integer (nullable = true)

+---------+----------+--------+-----+------+------+
|Firstname|Middlename|Lastname|ID   |Gender|Salary|
+---------+----------+--------+-----+------+------+
|James    |          |Smith   |36636|M     |3000  |
|Micheal  |Rose      |        |40288|M     |4000  |
|Robert   |          |Williams|42114|M     |4000  |
|Maria    |Anne      |Jones   |39192|F     |4000  |
|Jen      |Mary      |Brown   |     |F     |-1    |
+---------+----------+--------+-----+------+------+

In [42]:
#Converting dataframe into pandas dataframe
pandasDF = df.toPandas()

In [43]:
pandasDF

  Firstname Middlename  Lastname     ID Gender  Salary
0     James                Smith  36636      M    3000
1   Micheal       Rose            40288      M    4000
2    Robert             Williams  42114      M    4000
3     Maria       Anne     Jones  39192      F    4000
4       Jen       Mary     Brown             F      -1

In [44]:
pandasDF.shape

(5, 6)

In [48]:
#Default - displays 20 rows and 20 characters from column value
df.show()

+---------+----------+--------+-----+------+------+
|Firstname|Middlename|Lastname|   ID|Gender|Salary|
+---------+----------+--------+-----+------+------+
|    James|          |   Smith|36636|     M|  3000|
|  Micheal|      Rose|        |40288|     M|  4000|
|   Robert|          |Williams|42114|     M|  4000|
|    Maria|      Anne|   Jones|39192|     F|  4000|
|      Jen|      Mary|   Brown|     |     F|    -1|
+---------+----------+--------+-----+------+------+

In [49]:
#Display full column contents
df.show(truncate = False)

+---------+----------+--------+-----+------+------+
|Firstname|Middlename|Lastname|ID   |Gender|Salary|
+---------+----------+--------+-----+------+------+
|James    |          |Smith   |36636|M     |3000  |
|Micheal  |Rose      |        |40288|M     |4000  |
|Robert   |          |Williams|42114|M     |4000  |
|Maria    |Anne      |Jones   |39192|F     |4000  |
|Jen      |Mary      |Brown   |     |F     |-1    |
+---------+----------+--------+-----+------+------+

In [50]:
#Display 2 rows and full columns
df.show(2,truncate = False)

+---------+----------+--------+-----+------+------+
|Firstname|Middlename|Lastname|ID   |Gender|Salary|
+---------+----------+--------+-----+------+------+
|James    |          |Smith   |36636|M     |3000  |
|Micheal  |Rose      |        |40288|M     |4000  |
+---------+----------+--------+-----+------+------+
only showing top 2 rows

In [62]:
#Display 2 rows and column values 5 characters
df.show(2,truncate=5)

+---------+----------+--------+-----+------+------+
|Firstname|Middlename|Lastname|   ID|Gender|Salary|
+---------+----------+--------+-----+------+------+
|    James|          |   Smith|36636|     M|  3000|
|    Mi...|      Rose|        |40288|     M|  4000|
+---------+----------+--------+-----+------+------+
only showing top 2 rows

In [56]:
#Display Dataframe rows and columns vertically
df.show(n=3 , truncate=25, vertical = True)

-RECORD 0--------------
 Firstname  | James
 Middlename |
 Lastname   | Smith
 ID         | 36636
 Gender     | M
 Salary     | 3000
-RECORD 1--------------
 Firstname  | Micheal
 Middlename | Rose
 Lastname   |
 ID         | 40288
 Gender     | M
 Salary     | 4000
-RECORD 2--------------
 Firstname  | Robert
 Middlename |
 Lastname   | Williams
 ID         | 42114
 Gender     | M
 Salary     | 4000
only showing top 3 rows

In [63]:
#TO have a better understanding on truncate
columns= ['SeqNo.' , 'Quote']
data = [('1' , 'Be the change you wish to see in the world'),
        ('2' , 'Everyone thinks of changing the world , but no one thinks of changing themselves'),
        ('3', 'Be cool')]
df = spark.createDataFrame(data,columns)
df.show()

+------+--------------------+
|SeqNo.|               Quote|
+------+--------------------+
|     1|Be the change you...|
|     2|Everyone thinks o...|
|     3|             Be cool|
+------+--------------------+

In [64]:
df.show(truncate=False)

+------+--------------------------------------------------------------------------------+
|SeqNo.|Quote                                                                           |
+------+--------------------------------------------------------------------------------+
|1     |Be the change you wish to see in the world                                      |
|2     |Everyone thinks of changing the world , but no one thinks of changing themselves|
|3     |Be cool                                                                         |
+------+--------------------------------------------------------------------------------+

In [68]:
df.show(2,truncate=25)

+------+-------------------------+
|SeqNo.|                    Quote|
+------+-------------------------+
|     1|Be the change you wish...|
|     2|Everyone thinks of cha...|
+------+-------------------------+
only showing top 2 rows

In [69]:
df.show(2,truncate=15)

+------+---------------+
|SeqNo.|          Quote|
+------+---------------+
|     1|Be the chang...|
|     2|Everyone thi...|
+------+---------------+
only showing top 2 rows

>> We use truncate for display and reviewing the data

In [75]:
#Nesting
structureData = [
    (("James","","Smith"),"36636","M",3100),
    (("Michael","Rose",""),"40288","M",4300),
    (("Robert","","Williams"),"42114","M",1400),
    (("Maria","Anne","Jones"),"39192","F",5500),
    (("Jen","Mary","Brown"),"","F",-1)
  ]
structureSchema = StructType([
        StructField('name', StructType([
             StructField('firstname', StringType(), True),
             StructField('middlename', StringType(), True),
             StructField('lastname', StringType(), True)
             ])),
         StructField('id', StringType(), True),
         StructField('gender', StringType(), True),
         StructField('salary', IntegerType(), True)
         ])

df2 = spark.createDataFrame(data=structureData,schema=structureSchema)
df2.printSchema()
df2.show(truncate=False)

root
 |-- name: struct (nullable = true)
 |    |-- firstname: string (nullable = true)
 |    |-- middlename: string (nullable = true)
 |    |-- lastname: string (nullable = true)
 |-- id: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: integer (nullable = true)

+--------------------+-----+------+------+
|name                |id   |gender|salary|
+--------------------+-----+------+------+
|{James, , Smith}    |36636|M     |3100  |
|{Michael, Rose, }   |40288|M     |4300  |
|{Robert, , Williams}|42114|M     |1400  |
|{Maria, Anne, Jones}|39192|F     |5500  |
|{Jen, Mary, Brown}  |     |F     |-1    |
+--------------------+-----+------+------+

In [77]:
#Adding and changing the structure of the data

In [80]:
from pyspark.sql.functions import col,struct,when
updatedDF = df2.withColumn("OtherInfo", 
    struct(col("id").alias("identifier"),
    col("gender").alias("gender"),
    col("salary").alias("salary"),
    when(col("salary").cast(IntegerType()) < 2000,"Low")
      .when(col("salary").cast(IntegerType()) < 4000,"Medium")
      .otherwise("High").alias("Salary_Grade")
  )).drop("id","gender","salary")

updatedDF.printSchema()
updatedDF.show(truncate=False)

root
 |-- name: struct (nullable = true)
 |    |-- firstname: string (nullable = true)
 |    |-- middlename: string (nullable = true)
 |    |-- lastname: string (nullable = true)
 |-- OtherInfo: struct (nullable = false)
 |    |-- identifier: string (nullable = true)
 |    |-- gender: string (nullable = true)
 |    |-- salary: integer (nullable = true)
 |    |-- Salary_Grade: string (nullable = false)

+--------------------+------------------------+
|name                |OtherInfo               |
+--------------------+------------------------+
|{James, , Smith}    |{36636, M, 3100, Medium}|
|{Michael, Rose, }   |{40288, M, 4300, High}  |
|{Robert, , Williams}|{42114, M, 1400, Low}   |
|{Maria, Anne, Jones}|{39192, F, 5500, High}  |
|{Jen, Mary, Brown}  |{, F, -1, Low}          |
+--------------------+------------------------+